<!-- здесь мы пишем каркас -->
<template>
  <div>
    <div>
      <!-- v:on - это специальная директива для слушаталей события (аттрибут) после него идет слушатель события (обработчик). Также директиву v:on можно заменить на более коротку запись, мы указываем @click и пишем название события (так я сделал во втором счетчике) -->
      <button v-on:click="addlikes">Like</button>
      <button @click="addDislike">Dislike</button>
    </div>
    <div>
      <h1>Кол-во лайков: {{ likes }}</h1>
      <h1>Кол-во дизлайков: {{ dislikes }}</h1>
    </div>
  </div>
</template>

<!-- здесь описываем логику (создаем функции и тд) и всегда по дефолту должны экспортить объект -->
<script>
export default {
  /* здесь мы по сути объявили переменные likes, dislikes. Во Vue такие значения называются моделями  */
  data() {
    return {
      likes: 0,
      dislikes: 0,
    }
  },
  methods: {
    addlikes() {
      this.likes += 1
    },
    addDislike() {
      this.dislikes -= 1
    },
  },
}
</script>

<style></style>

<!-- функции объявляются в поле methods у комопнента -->

<!-- интерполяция - синтаксис для интеграци логики в шаблон -->
